src/__tests__/mock-response/reservation-by-id-rs.xml

<?xml version="1.0" encoding="utf-8"?>
<reservationByIdRS>
  <reservation>
    <hotelId>123</hotelId>
    <portalId>1</portalId>
    <id>2222</id>
    <status>new</status>
    <createDateTime>2011-12-30T23:39:00Z</createDateTime>
    <paymentType>1</paymentType>
    <remark>Comentários adicionais</remark>
    <currencyCode>BRL</currencyCode>
    <locatorId>5689</locatorId>
    <totalValue>350,00</totalValue>
    <rooms>
      <room>
        <id>1</id>
        <roomLocatorId>265992</roomLocatorId>
        <roomTypeId>222</roomTypeId>
        <status>active</status>
        <arrivalDate>22/10/2016</arrivalDate>
        <departureDate>24/10/2016</departureDate>
        <adults>2</adults>
        <children>1</children>
        <ageChildren>
          <ageChild>3</ageChild>
        </ageChildren>
        <totalValue>300,00</totalValue>
        <remark>Comentários adicionais</remark>
        <addons>
          <addon>
            <name>Decoração especial no quarto</name>
            <totalValue>50,00</totalValue>
          </addon>
        </addons>
        <dailyRates>
          <dailyRate>
            <date>22/10/2016</date>
            <totalValue>130,00</totalValue>
          </dailyRate>
          <dailyRate>
            <date>23/10/2016</date>
            <totalValue>120,00</totalValue>
          </dailyRate>
        </dailyRates>
        <mealPlan>1</mealPlan>
        <guest>
          <firstName>Antonio Rodrigues</firstName>
          <lastName>Antonio Rodrigues</lastName>
          <email>ar@host.com</email>
        </guest>
      </room>
    </rooms>
    <guest>
      <firstName>Antonio Rodrigues</firstName>
      <lastName>Antonio Rodrigues</lastName>
      <documentType>CPF</documentType>
      <documentNumber>22687496532</documentNumber>
      <email>ar@host.com</email>
      <phone>1141267898</phone>
    </guest>
    <payment>
      <cardType>VISA</cardType>
      <cardNumber>000055565456444</cardNumber>
      <cardHolderName>Franco Roberto</cardHolderName>
      <seriesCode>123</seriesCode>
      <expireDate>12/2015</expireDate>
      <prePaymentValue>95,50</prePaymentValue>
      <prePaymentCharged>true</prePaymentCharged>
      <authorizationCode>34cx5632xxgr2111</authorizationCode>
    </payment>
    <collectType>HotelCollect</collectType>
  </reservation>
</reservationByIdRS>
